# Πίνακας Πτήση:
CREATE TABLE Πτήση (
  `Αριθμός Πτήσης` int(10) NOT NULL AUTO_INCREMENT,
  `Αεροπορική Εταιρία` varchar(255),
  `τύπος πτήσης` varchar(255),
  `πόλη προέλευσης` varchar(255),
  `πόλη προορισμού` varchar(255),
  `Προσωπικό ΠτήσηςΠηλότος` varchar(255) NOT NULL,
  `Προσωπικό ΠτήσηςΑεροσυνοδός` varchar(255) NOT NULL,
  `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης` int(11) NOT NULL,
  PRIMARY KEY (`Αριθμός Πτήσης`)
);
INSERT INTO Πτήση (`Αεροπορική Εταιρία`, `τύπος πτήσης`, `πόλη προέλευσης`, `πόλη προορισμού`, `Προσωπικό ΠτήσηςΠηλότος`, `Προσωπικό ΠτήσηςΑεροσυνοδός`, `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης`)
VALUES
('Aegean Airlines', 'αφίχθεισα', 'Αθήνα', 'Θεσσαλονίκη', 'Γιάννης', 'Μαρία', 1),
('Ryanair', 'αναχωρούσα', 'Πάτρα', 'Πάρος', 'Νίκος ', 'Ελένη', 2),
('British Airways', 'αφίχθεισα', 'Μύκονος', 'Αθήνα', 'Τζον ', 'Σοφία', 3),
('Lufthansa', 'αφίχθεισα', 'Κρήτη', 'Κέρκυρα', 'Μάρκος ', 'Άννα', 4),
('Emirates', 'αναχωρούσα', 'Πάτρα', 'Κέρκυρα', 'Δημήτρης ', 'Ελένη', 5);

# Πίνακας Πύλη
CREATE TABLE Πύλη (
`Αριθμός Πύλης` int(11) NOT NULL AUTO_INCREMENT,
`Προσωπικό ασφαλείας` int(11),
`Προσωπικό ΑσφαλείαςΚωδικός Ασφαλείας` int(11) NOT NULL,
`ΑεροδόμιοΌνομα Αεροδρομίου` varchar(255) NOT NULL,
PRIMARY KEY (`Αριθμός Πύλης`)
);
INSERT INTO Πύλη (Προσωπικό ασφαλείας, Προσωπικό ΑσφαλείαςΚωδικός Ασφαλείας, ΑεροδόμιοΌνομα Αεροδρομίου)
VALUES
(1, 1234, 'Ελευθέριος Βενιζέλος'),
(2, 5678, 'Μακεδονία'),
(3, 9012, 'Σπάτα'),
(4, 3456, 'Ηράκλειο Νίκος Καζαντζάκης'),
(5, 7890, 'Κεφαλονιά');

# Πίνακας Πραγματοποίηση Πτήσης
CREATE TABLE `Πραγματοποίηση Πτήσης` (
  `Τύπος Πτήσης` varchar(255) NOT NULL,
  `Τύπος Πύλης` varchar(255),
  `ΠύληΑριθμός Πύλης` int(11) NOT NULL,
  `ΑεροπλάνοΚωδικός αεροπλάνου` int(11) NOT NULL,
  PRIMARY KEY (`Τύπος Πτήσης`)
);
INSERT INTO `Πραγματοποίηση Πτήσης` (`Τύπος Πτήσης`, `Τύπος Πύλης`, `ΠύληΑριθμός Πύλης`, `ΑεροπλάνοΚωδικός αεροπλάνου`)
VALUES
('αφίχθεισα', 'άφιξης', 14, 1001),
('αφίχθεισα', 'άφιξης', 8, 1002),
('αναχωρούσα', 'αναχώρησης', 5, 1003),
('αναχωρούσα', 'αναχώρησης', 2, 1004),
('αφίχθεισα', 'άφιξης', 105, 6);


# Πίνακας Προσωπικό Ασφαλείας
CREATE TABLE `Προσωπικό Ασφαλείας` (
  `Κωδικός Ασφαλείας` int(11) NOT NULL AUTO_INCREMENT,
  `Πύλη Απασχόλησης` varchar(255),
  PRIMARY KEY (`Κωδικός Ασφαλείας`)
);
INSERT INTO `Προσωπικό Ασφαλείας` (`Πύλη Απασχόλησης`)
VALUES
('Πύλη Α'),
('Πύλη Β'),
('Πύλη Γ'),
('Πύλη Δ'),
('Πύλη Ε');

# Πίνακας Αεροπλάνο
CREATE TABLE Αεροπλάνο (
  `Κωδικός αεροπλάνου` int(11) NOT NULL AUTO_INCREMENT,
  `Όνομα Αεροπλάνου` varchar(255),
  `Έτος κατασκευής` year,
  `Τύπος Αεροπλάνου` int(11),
  `Τύπος ΑεροπλάνουΌνομα Τύπου Αεροπλάνου` varchar(255) NOT NULL,
  PRIMARY KEY (`Κωδικός αεροπλάνου`)
);

INSERT INTO Αεροπλάνο (`Όνομα Αεροπλάνου`, `Έτος κατασκευής`, `Τύπος Αεροπλάνου`, `Τύπος ΑεροπλάνουΌνομα Τύπου Αεροπλάνου`)
VALUES
('Airbus A320', '2008', 1, 'Επιβατικό'),
('Boeing 747', '1995', 2, 'Μεγάλης Χωρητικότητας'),
('Cessna 172', '1982', 3, 'Μονοκινητήριο'),
('Embraer E175', '2010', 1, 'Επιβατικό'),
('Gulfstream G650', '2017', 4, 'Ιδιωτικό');

# Πίνακας Πύλη_Πραγματοποίηση Πτήσης

CREATE TABLE `Πύλη_Πραγματοποίηση Πτήσης` (
  `ΠύληΑριθμός Πύλης` int(11) NOT NULL,
  `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης` int(11) NOT NULL,
  PRIMARY KEY (`ΠύληΑριθμός Πύλης`, `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης`)
);
INSERT INTO `Πύλη_Πραγματοποίηση Πτήσης` (`ΠύληΑριθμός Πύλης`, `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης`)
VALUES
(1, 1),
(2, 1),
(3, 2),
(4, 2),
(5, 3);

# Πίνακας Τύπος Αεροπλάνου
CREATE TABLE `Τύπος Αεροπλάνου` (
  `Όνομα Τύπου Αεροπλάνου` varchar(255) NOT NULL,
  `χωρητικότητά Θέσεων` int(11),
  `Μέγιστη Απόσταση Πτήσης` int(11),
  `Τεχνικοί ΑεροπλάνωνΕιδικότητα` varchar(255) NOT NULL,
  PRIMARY KEY (`Όνομα Τύπου Αεροπλάνου`)
);
INSERT INTO `Τύπος Αεροπλάνου` (`Όνομα Τύπου Αεροπλάνου`, `χωρητικότητά Θέσεων`, `Μέγιστη Απόσταση Πτήσης`, `Τεχνικοί ΑεροπλάνωνΕιδικότητα`)
VALUES
('Τύπος1', 150, 1000, 'Μηχανικός'),
('Τύπος2', 200, 1500, 'Ηλεκτρονικός'),
('Τύπος3', 300, 2000, 'Μηχανικός'),
('Τύπος4', 250, 1800, 'Ηλεκτρονικός'),
('Τύπος5', 180, 1200, 'Μηχανικός');

# Πίνακας Κάυσημα
CREATE TABLE Κάυσημα (
`Όνομα Καυσίμων` varchar(255) NOT NULL,
`Τιμή ανά λίτρο` numeric(19, 0),
`Αριθμός Οκτανίων` int(11),
`ΑεροπλάνοΚωδικός αεροπλάνου` int(11) NOT NULL,
PRIMARY KEY (`Όνομα Καυσίμων`)
);

INSERT INTO `Κάυσημα` (`Όνομα Καυσίμων`, `Τιμή ανά λίτρο`, `Αριθμός Οκτανίων`, `ΑεροπλάνοΚωδικός αεροπλάνου`)
VALUES
  ('Αεροπλανέλαιο', 2.35, 100, 1),
  ('Αβιατέριο', 3.10, 100, 2),
  ('Κηροζίνη', 2.90, 90, 1),
  ('Υγραέριο', 1.80, 95, 3),
  ('Υδρογονάνθρακες', 2.50, 98, 2);
  
# Πίνακας Τέστ Αεροπλάνων
CREATE TABLE `Τέστ Αεροπλάνων` (
Όνομα varchar(255) NOT NULL, 
`Column` int(10), 
`ΑεροπλάνοΚωδικός αεροπλάνου` int(11) NOT NULL,
PRIMARY KEY (Όνομα)
);

INSERT INTO `Τέστ Αεροπλάνων` (Όνομα, `Column`, `ΑεροπλάνοΚωδικός αεροπλάνου`)
VALUES
('Τέστ1', 1, 1),
('Τέστ2', 2, 2),
('Τέστ3', 3, 3),
('Τέστ4', 4, 4),
('Τέστ5', 5, 5);

# Πίνακας Τμήματα Ελέγχων
CREATE TABLE `Τμήματα Ελέγχων` (
`Έλεγχος ΑεροπλάνωνΌνομα` varchar(255) NOT NULL, 
`Αριθμός Τμήματος` int(11) NOT NULL AUTO_INCREMENT,
Τεχνικός int(11), 
PRIMARY KEY (`Αριθμός Τμήματος`)
);

INSERT INTO `Τμήματα Ελέγχων` (`Έλεγχος ΑεροπλάνωνΌνομα`, `Αριθμός Τμήματος`, `Τεχνικός`)
VALUES
  ('Έλεγχος 1', 1, 1),
  ('Έλεγχος 2', 2, 2),
  ('Έλεγχος 3', 3, 1),
  ('Έλεγχος 4', 4, 3),
  ('Έλεγχος 5', 5, 2);

# Πίνακας Τμήματα Ελέγχων
CREATE TABLE `Πληροφορίες Ελέγχων` (
`Ημερομηνία διεξαγωγής Ελέγχων` date NOT NULL, 
`Αποτελέσματα Ελέγχων` int(11) NOT NULL,
`Τμήματα ΕλέγχωνΑριθμός Τμήματος` int(11) NOT NULL,
PRIMARY KEY (`Ημερομηνία διεξαγωγής Ελέγχων`, `Αποτελέσματα Ελέγχων`)
);

INSERT INTO `Πληροφορίες Ελέγχων` (`Ημερομηνία διεξαγωγής Ελέγχων`, `Αποτελέσματα Ελέγχων`, `Τμήματα ΕλέγχωνΑριθμός Τμήματος`)
VALUES
  ('2023-01-01', 1, 1),
  ('2023-02-02', 2, 2),
  ('2023-03-03', 3, 1),
  ('2023-04-04', 4, 3),
  ('2023-05-05', 5, 2);
  
# Πίνακας Τεχνικοί Αεροπλάνων
CREATE TABLE `Τεχνικοί Αεροπλάνων` (
Όνομα varchar(255),
Ειδικότητα varchar(255) NOT NULL,
PRIMARY KEY (Ειδικότητα)
);

INSERT INTO `Τεχνικοί Αεροπλάνων` (`Όνομα`, `Ειδικότητα`)
VALUES ('Γιάννης Παπαδόπουλος', 'Μηχανικός Αεροσκαφών'),
       ('Μαρία Ανδρέου', 'Ηλεκτρολόγος Αεροπορικών Συστημάτων'),
       ('Νίκος Παπαδόπουλος', 'Μηχανικός Προπέλων'),
       ('Αλέξανδρος Κοντογιάννης', 'Μηχανικός Υδραυλικών Συστημάτων'),
       ('Ελένη Παναγοπούλου', 'Τεχνικός Ελεγκτής Πτήσεων');










































































































































































