# Πίνακας Πτήση:
CREATE TABLE Πτήση (
  `Αριθμός Πτήσης` int(10) NOT NULL AUTO_INCREMENT,
  `Αεροπορική Εταιρία` varchar(255),
  `τύπος πτήσης` varchar(255),
  `πόλη προέλευσης` varchar(255),
  `πόλη προορισμού` varchar(255),
  `Προσωπικό ΠτήσηςΠηλότος` varchar(255) NOT NULL,
  `Προσωπικό ΠτήσηςΑεροσυνοδός` varchar(255) NOT NULL,
  `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης` int(11) NOT NULL,
  PRIMARY KEY (`Αριθμός Πτήσης`)
);
INSERT INTO Πτήση (`Αεροπορική Εταιρία`, `τύπος πτήσης`, `πόλη προέλευσης`, `πόλη προορισμού`, `Προσωπικό ΠτήσηςΠηλότος`, `Προσωπικό ΠτήσηςΑεροσυνοδός`, `Πραγματοποίηση ΠτήσηςΤύπος Πτήσης`)
VALUES
('Aegean Airlines', 'αφίχθεισα', 'Αθήνα', 'Θεσσαλονίκη', 'Γιάννης', 'Μαρία', 1),
('Ryanair', 'αναχωρούσα', 'Πάτρα', 'Πάρος', 'Νίκος ', 'Ελένη', 2),
('British Airways', 'αφίχθεισα', 'Μύκονος', 'Αθήνα', 'Τζον ', 'Σοφία', 3),
('Lufthansa', 'αφίχθεισα', 'Κρήτη', 'Κέρκυρα', 'Μάρκος ', 'Άννα', 4),
('Emirates', 'αναχωρούσα', 'Πάτρα', 'Κέρκυρα', 'Δημήτρης ', 'Ελένη', 5);

# Πίνακας Πύλη
CREATE TABLE Πύλη (
`Αριθμός Πύλης` int(11) NOT NULL AUTO_INCREMENT,
`Προσωπικό ασφαλείας` int(11),
`Προσωπικό ΑσφαλείαςΚωδικός Ασφαλείας` int(11) NOT NULL,
`ΑεροδόμιοΌνομα Αεροδρομίου` varchar(255) NOT NULL,
PRIMARY KEY (`Αριθμός Πύλης`)
);
INSERT INTO Πύλη (Προσωπικό ασφαλείας, Προσωπικό ΑσφαλείαςΚωδικός Ασφαλείας, ΑεροδόμιοΌνομα Αεροδρομίου)
VALUES
(1, 1234, 'Ελευθέριος Βενιζέλος'),
(2, 5678, 'Μακεδονία'),
(3, 9012, 'Σπάτα'),
(4, 3456, 'Ηράκλειο Νίκος Καζαντζάκης'),
(5, 7890, 'Κεφαλονιά');

# Πίνακας Πραγματοποίηση Πτήσης
CREATE TABLE `Πραγματοποίηση Πτήσης` (
  `Τύπος Πτήσης` varchar(255) NOT NULL,
  `Τύπος Πύλης` varchar(255),
  `ΠύληΑριθμός Πύλης` int(11) NOT NULL,
  `ΑεροπλάνοΚωδικός αεροπλάνου` int(11) NOT NULL,
  PRIMARY KEY (`Τύπος Πτήσης`)
);
INSERT INTO `Πραγματοποίηση Πτήσης` (`Τύπος Πτήσης`, `Τύπος Πύλης`, `ΠύληΑριθμός Πύλης`, `ΑεροπλάνοΚωδικός αεροπλάνου`)
VALUES
('αφίχθεισα', 'άφιξης', 14, 1001),
('αφίχθεισα', 'άφιξης', 8, 1002),
('αναχωρούσα', 'αναχώρησης', 5, 1003),
('αναχωρούσα', 'αναχώρησης', 2, 1004),
('αφίχθεισα', 'άφιξης', 105, 6);


# Πίνακας Προσωπικό Ασφαλείας
CREATE TABLE `Προσωπικό Ασφαλείας` (
  `Κωδικός Ασφαλείας` int(11) NOT NULL AUTO_INCREMENT,
  `Πύλη Απασχόλησης` varchar(255),
  PRIMARY KEY (`Κωδικός Ασφαλείας`)
);
INSERT INTO `Προσωπικό Ασφαλείας` (`Πύλη Απασχόλησης`)
VALUES
('Πύλη Α'),
('Πύλη Β'),
('Πύλη Γ'),
('Πύλη Δ'),
('Πύλη Ε');

# 
























































































































































































