



  
 
  


       

  



-- Πίνακας Αεροπλάνο:
CREATE TABLE Αεροπλάνο (
    Όνομα varchar(255) PRIMARY KEY,
    `Έτος Κατασκευής` int(10),
    `Τύπος καυσίμου` varchar(255)
    τύπος varchar(255)

);
INSERT INTO Αεροπλάνο (Όνομα, `Έτος Κατασκευής`, `Τύπος καυσίμου`)
VALUES
    (1, 2010),
    (2, 2015),
    (3, 2005),
    (4, 2018),
    (5, 2012);
    

-- Πίνακας: περίπτερα εξυπηρέτησης πελατών
CREATE TABLE `περίπτερα εξυπηρέτησης πελατών` (
    id int(10) PRIMARY KEY,
    `όνομα αεροδρομίου` varchar(255),
);

INSERT INTO `περίπτερα εξυπηρέτησης πελατών` (id ,`όνομα αεροδρομίου`)
VALUES
  (233,'Αεροπορικές Εταιρείες ΑΕ'),
  (213,'Τουριστική Αεροπορία ΟΕ'),
  (142,'Αεροπορία Α.Ε.Β.Ε.'),
  (125,'Εξυπηρέτηση Επιβατών Δημ. ΟΕ');
 
  
